Autodesk.Revit.UI.EditorInteraction.InteractionType
The type of interaction.
Remarks:
This property is overridable to allow for clients to
dynamically return the type. For example, if your pane
interacts with certain editors or has different "modes"
based on user workflow.

Autodesk.Revit.UI.EditorInteraction.#ctor(Autodesk.Revit.UI.EditorInteractionType)
Construct the interaction with the specified type.

Autodesk.Revit.UI.EditorInteraction.#ctor
Construct a default interaction.

Autodesk.Revit.UI.EditorInteraction
Wraps the EditorInteractionType for the Pane to allow
for clients to override their type dynamically if need
be.
Since:
2017